<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
   "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="de">
<head>
        <title>sidux-seminarix - Lernspiele</title>
	<meta http-equiv="content-type" content="text/html; charset=utf-8" />
	<style type="text/css" media="all">@import url("../lib/css-js/seminarix.css");</style>
	<style type="text/css" media="all">@import url("../lib/css-js/seminarix1-menu.css");</style>
	<style type="text/css" media="print">@import url("../lib/css-js/print.css");</style>
        <link rel="shortcut icon" href="../lib/favicon/manual.ico" />
	<script type="text/javascript" src="../lib/css-js/menu2.js"></script>
        <!--[if lt IE 8]>
        <link rel="stylesheet" type="text/css" href="../lib/css-js/ie_5-7_override.css">
        <![endif]-->
        <!--[if lt IE 7]>
        <link rel="stylesheet" type="text/css" href="../lib/css-js/ie_5-6_override.css">
        <![endif]-->
</head>
<body>
<!-- last translation revision by xxxx xx/xx/xxxx xxxx utc-->
<div id="menu"> <!-- menu starts here maintainer de xxxxxxxx -->
<!--Welcome to the  sidux-manual  edu manual  00.05-2009-04-05 -->
<!-- menu last updated by bluewater 08/04/2009 1000rs UTC -->
<img src="../lib/logos/sidux_logo.png" alt="logo" id="menu-header" />
	<ul id="top-list">
		<li><a href="http://sidux.com/">Zu sidux.com</a></li>
		<li><a href="http://manual.sidux.com/">sidux OS Handbuch</a></li>
	</ul>
	<div id="flags-2">
			<a href="../flag-index.html"><img src="../lib/logos/sidux-language-64.png" title="Wählen Sie eine andere Sprache - Choose another language" alt="lang-switch" /></a>
	</div>
	<ul>
		<li  onmouseover="showHide( 1 );" onmouseout="startTime();" ><a href="willkommen-de.html"> Projekt Seminarix</a>
			<ul class="sub-menu" id="sm1">
				<li><a href="willkommen-de.html">Willkommen</a></li>
				<li><a href="impressum-de.html">Impressum</a></li>
			</ul>
		</li>
		<li  onmouseover="showHide( 2 );" onmouseout="startTime();" ><a href="allgemein-de.html">Allgemein</a>
			<ul class="sub-menu" id="sm2">
				<li><a href="allgemein-de.html">Allgemein</a></li>
			</ul>
		</li>
		<li  onmouseover="showHide( 3 );" onmouseout="startTime();" ><a href="chemie-de.html">Chemie</a>
			<ul class="sub-menu" id="sm3">
				<li><a href="chemie-de.html">Chemie</a></li>
			</ul>
		</li>
		<li  onmouseover="showHide( 4 );" onmouseout="startTime();" ><a  href="erdkunde-de.html">Erdkunde</a>
			<ul class="sub-menu" id="sm4">
  				<li><a  href="erdkunde-de.html">Erdkunde</a></li>
			</ul>
		</li>
		<li  onmouseover="showHide( 5 );" onmouseout="startTime();" ><a  href="elearning-de.html">E-Learning</a>
			<ul class="sub-menu" id="sm5">
				<li><a  href="elearning-de.html">E-Learning</a></li>
			</ul>
		</li>
		<li  onmouseover="showHide( 6 );" onmouseout="startTime();" ><a href="informatik-de.html">Informatik</a>
			<ul class="sub-menu" id="sm6">
					<li><a href="informatik-de.html">Informatik</a></li>
			</ul>
		</li>
		<li  onmouseover="showHide( 7 );" onmouseout="startTime();" ><a href="kunst-de.html">Kunst</a>
			<ul class="sub-menu" id="sm7">
					<li><a href="kunst-de.html">Kunst</a></li>
			</ul>
		</li>
		<li  onmouseover="showHide( 8 );" onmouseout="startTime();" ><a  href="lernspiele-de.html">Lernspiele</a>
			<ul class="sub-menu" id="sm8">
					<li><a href="lernspiele-de.html">Lernspiele</a></li>
			</ul>
		</li>
		<li  onmouseover="showHide( 9 );" onmouseout="startTime();" ><a  href="mathematik-de.html">Mathematik</a>
			<ul class="sub-menu" id="sm9">
					<li><a  href="mathematik-de.html">Mathematik</a></li>
			</ul>
		</li>
		<li  onmouseover="showHide( 10 );" onmouseout="startTime();" ><a  href="musik-de.html">Musik</a>
			<ul class="sub-menu" id="sm10">
					<li><a  href="musik-de.html">Musik</a></li>
			</ul>
		</li>
		<li  onmouseover="showHide( 11 );" onmouseout="startTime();" ><a  href="physik-de.html">Physik</a>
			<ul class="sub-menu" id="sm11">
					<li><a href="physik-de.html">Physik</a></li>
			</ul>
		</li>
		<li  onmouseover="showHide( 12 );" onmouseout="startTime();" ><a href="religion-de.html">Religion</a>
			<ul class="sub-menu" id="sm12">
					<li><a href="religion-de.html">Religion</a></li>
			</ul>
		</li>
		<li  onmouseover="showHide( 13 );" onmouseout="startTime();" ><a href="sprachen-de.html">Sprachen</a>
			<ul class="sub-menu" id="sm13">
					<li><a href="sprachen-de.html">Sprachen</a></li>
			</ul>
		</li>
		<li  onmouseover="showHide( 14 );" onmouseout="startTime();" ><a href="technik-de.html">Technik</a>
			<ul class="sub-menu" id="sm14">
					<li><a href="technik-de.html">Technik</a></li>
			</ul>
		</li>
		<li  onmouseover="showHide( 15 );" onmouseout="startTime();" ><a href="seminarix-intern-de.html">Seminarix-Intern</a>
			<ul class="sub-menu" id="sm15">
				<li><a href="seminarix-intern-de.html">Seminarix-Intern</a></li>
			</ul>
		</li>
	</ul>
<!-- menu ends here --> </div> <!-- menu ends here -->

<div id="main-page">

        <div class="divider" id="lernspiele">

<div class="screenshot"><img src="../lib/logos/seminarix_logo_hp.png" alt="seminarix_logo" /></div>

                       					<p class="highlight-3">Seminarix ist ein auf sidux aufbauendes Live-Medium, welches f&uuml;r die Lehrerausbildung entwickelt wurde</p>

					<h1 id="top-header"><img src="../lib/images-common/Lernspiele.png" alt="logo-Lernspiele" width="40" height="40" />&nbsp;&nbsp;Abteilung Lernspiele</h1>

                			<h3>Vorbemerkung</h3>

                       					<p>Mit Lernspielen kommen viele in einen n&auml;heren und schnelleren Kontakt mit M&ouml;glichkeiten, die die Rechner bieten.</p>

                       					<p>In der Arbeit mit J&uuml;ngeren (etwa an Grundschulen) bieten sie dar&uuml;ber hinaus auch noch Gelegenheiten, einfache Routinen (z. B. Umgang mit der Maus oder der Tastatur) und Kombinationsspiele einzu&uuml;ben.</p>
							
					<h3>Programmvorstellungen</h3>
							
							<p class="highlight-3">Die Programme k&ouml;nnen Sie mit Hilfe des Programmstarters eduversum starten bzw nachinstallieren. Unter dem Men&#252;punkt  "Lernspiele" finden Sie die Programme dieser Seite. Den Programmstarter finden Sie im "Kde-Men&#252;" im Untermen&#252; "Dienstprogramme", oder klicken Sie einfach das eduversum Icon auf dem Desktop.</p>

					<h3>BlinKen</h3>

							<p>Bei BlinKen geht es darum, sich immer l&auml;nger werdende Tasten- bzw. Tonfolgen zu merken, stellt also eine besondere Form des Ged&auml;chtnistrainings dar.</p>

							<p>Auf dem Spielger&auml;t von BlinKen sind vier verschiedenfarbige Kn&ouml;pfe und jeder hat seinen eigenen individuellen Ton. W&auml;hrend des Spieles leuchten die Kn&ouml;pfe in zuf&auml;lliger Reihenfolge, die der Spieler sich merken und wiederholen muss.</p>

                      					<p>Wenn der Spieler es schafft, die Sequenz in der richtigen Reihenfolge wiederzugeben, erreicht er die n&auml;chste Spielstufe, in der er die gleiche Sequenz plus einer weiteren Taste wiedergeben muss. Wenn die Reihenfolge einmal falsch ist, hat der Spieler verloren und muss von vorne beginnen.</p>

                      					<p>Das Ziel des Spiels ist es, m&ouml;glichst viele Punkte zu erreichen. Jede erfolgreiche Runde bringt einen Punkt, eine erfolgreiche Folge von acht Kn&ouml;pfen ergibt also acht Punkte in der Bestenliste.</p>

                      					<p>F&uuml;r das Merken der Tonfolgen ist eine betriebsbereite Soundkarte mit Lautsprecher oder Kopfh&ouml;rer erforderlich. Unter dem Hilfe-Button (Buchsymbol) kann man das deutschsprachige Handbuch aufrufen.</p>

                     					<p><a href="http://edu.kde.org/blinken/">BlinKen</a></p>
							
					<h3>Childsplay</h3>
							
							<p> Childsplay ist eine Sammlung von Lernspielen f&uuml;r Kinder, &auml;hnlich GCompris. Childsplay enth&auml;lt u.a. Mathe- und &nbsp;Schreibspiele und kann um andere Spiele erweitert werden.</p>

                                                        <p><a href="http://www.schoolsplay.org/">Childsplay</a>&nbsp;&nbsp;|&nbsp;&nbsp; <a href="http://www.childs-play.de/">Info Childsplay</a> </p>

					<h3>Einstein</h3>

							<p>Einstein Puzzle ist ein Programm, das eher f&uuml;r im logischen Denken h&ouml;her begabte Menschen gedacht ist. Es geht darum, ein Raster mit 6x6 Feldern nach bestimmten, sich ver&auml;ndernden Regeln mit Symbolen zu f&uuml;llen.</p>

							<p>Das Programm verf&uuml;gt &uuml;ber eine englischsprachige Hilfe.</p>

							<p><a href="http://games.flowix.com/en/index.html">Einstein</a></p>

					<h3>Gcompris</h3>

                     					<p>Gcompris ist eine gro&szlig;e Sammlung von Lernspielen f&uuml;r Kinder im Vorschul- und Grundschulalter. Gegenw&auml;rtig kann man mit Gcompris:</p>

						<ul>
                        				<li>den Umgang mit Maus und Tastatur erlernen</li>
							<li>Grundrechenarten lernen</li>
							<li>lernen von einer analogen Uhr abzulesen</li>
							<li>lernen, Buchstaben an ihrem Namen zu erkennen</li>
							<li>&uuml;ben zu lesen</li>
							<li>kleine Spiele (Memory, Puzzle-Spiele, etc.) spielen</li>
							<li>kleine Animationen erstellen</li>
							<li>und Einiges mehr</li>
						</ul>

							<p><a href="http://gcompris.net/-de-">Gcompris</a></p>

					<h3>gTans</h3>

                     					<p>gTans ist eine elektronische Version des chinesischen Knobel-Legespiels Tangram</p>

                     					<a href="http://gtans.sourceforge.net/">gTans</a>

					<h3>KAnagram</h3>

							<p>KAnagram ist ein Buchstabenr&auml;tselspiel: Aufgabe ist, die durcheinandergew&uuml;rfelten Buchstaben eines Wortes wieder in die richtige Reihenfolge zu bringen und damit das Wort zu finden.</p>

							<p>Es gibt keine Zeitbegrenzung und man hat beliebig viele Versuche zur L&ouml;sung des R&auml;tsels.</p>

							<p>Zusammen mit KAnagram erhalten die Sch&uuml;ler einige Vokabeldateien zum Spielen, weitere k&ouml;nnen aus dem Internet geladen werden.</p>

							<p>KAnagram bringt &uuml;ber den Hilfe-Button (Buchsymbol) ein Handbuch in deutscher Sprache mit.</p>

							<p><a href="http://edu.kde.org/kanagram/">KAnagram</a></p>

					<h3>Kartoffelkn&uuml;lch</h3>

                                                        <p>Kartoffelkn&uuml;lch ist ein Stempelprogramm, das drei fertige Sets aus Hintergrundbildern und passenden Stickern enth&auml;lt. Enthaltene Sets:&nbsp;Aquarium,&nbsp;Kartoffelkn&uuml;lch,Tux.</p>

                                                        <p>Das Programm ist Teil von KDE und im KDE-Games Paket enthalten.</p>

                                                        <p><a href="http://games.kde.org/kde_kids.php">Kartoffelkn&uuml;lch</a> </p>

					<h3>KHangMan</h3>

							<p>KHangMan basiert auf dem bekannten Galgenm&auml;nnchenspiel. Es ist f&uuml;r Kinder ab 6 Jahren geeignet und hat vier Schwierigkeitsstufen:</p>

							<p>Tiere (Tiernamen), Einfach, Mittel und Schwer. Ein Wort wird zuf&auml;llig ausgew&auml;hlt, die Buchstaben verdeckt und der Sch&uuml;ler muss das Wort raten, indem er einen vermuteten Buchstaben nach dem anderen eingibt.</p>

							<p>Jedes Mal, wenn Du einen falschen Buchstaben eingibst, wird das Galgenm&auml;nnchen weiter gezeichnet. Sch&uuml;ler m&uuml;ssen das gesuchte Wort erraten, ehe das Galgenm&auml;nnchen fertig gezeichnet ist! Daf&uuml;r gibt es zehn Versuche.</p>

							<p>Ein deutschsprachiges Handbuch kann &uuml;ber den Hilfe-Button aufgerufen werden.</p>

							<p><a href="http://edu.kde.org/khangman/">KHangMan</a></p>

					<h3>Knights</h3>

							<p>Bei Knights handelt es sich um ein Schachbrett f&uuml;r KDE-Nutzer. Das seit 2003 entwickelte Programm stellt mittlerweile eine starke Konkurrenz zu Xboard und Eboard dar. Komplett eingedeutscht, beherrscht es die Spielvarianten Nutzer gegen Engine, Engine gegen Engine und Online-Schach. In den Einstellungen bringt es bereits viele ICS-Server weltweit mit. Au&szlig;erdem stehen &uuml;ber 30 S&auml;tze an Skins und Figuren zur Auswahl.</p>

							<p><a href="http://knights.sourceforge.net/">Knights</a></p>

                                        <h3>KTouch</h3>

                                                        <p>KTouch ist ein &Uuml;bungsprogramm zum Maschinenschreiben f&uuml;r KDE.</p>

                                                        <p>Zun&auml;chst stellen Sie das gew&uuml;nschte Tastaturlayout (vermutlich de) ein. Unter "Lektion bearbeiten" Standardlektionen ausw&auml;hlen und dort eine der ...german...xml-Dateien anklicken.</p>

                                                        <p><a href="http://edu.kde.org/ktouch/">KTouch</a>&nbsp;&nbsp;|&nbsp;&nbsp; <a href="http://docs.kde.org/en/3.1/kdeedu/ktouch/">Info KTouch</a></p>

					<h3>lletters</h3>

							<p>Ein Programm f&uuml;r Kinder im Vor- und Grundschulalter, um die Bedeutung von Zahlen und Buchstaben zu lernen.</p>

							<p>Nach einem Mausklick auf eine Zahl oder einen Buchstaben wird das Bild eines Gegenstands mit dem entsprechenden Anfangsbuchstaben (bzw. die entsprechende Anzahl von Gegenst&auml;nden bei einer Zahl) inklusive Schreibweise angezeigt.</p>

							<p>Leider liegt dieses Programm nur in Englisch und Franz&ouml;sisch vor - dadurch eignet es sich allerdings auch f&uuml;r etwas &auml;ltere Kinder, um Grundbegriffe einer Fremdsprache kennen zu lernen.</p>

							<p><a href="http://lln.sourceforge.net/">lletters</a></p>

					<h3>LMemory</h3>

							<p>LMemory ist das bekannte Memoryspiel mit verdeckten Bildkarten. Es gibt bei LMemory verschiedene Schwierigkeitsgrade. Als Option gibt es dar&uuml;ber hinaus z. B., dass 3 gleiche Karten gefunden werden m&uuml;ssen.</p>

							<p><a href="http://lgames.sourceforge.net/index.php?project=LMemory">LMemory</a></p>

					<h3>Palapeli</h3>

							<p>Palapeli ist das finnische Wort für Puzzlespiel. Anders als üblich, gibt es bei Palapeli keine Randbegrenzung und die Teile können frei bewegt werden. Ist Bestandteil des Programmpaketes kdegames.</p>

							<p><a href="http://www.kde-apps.org/content/show.php/Palapeli?content=82539">Palapeli</a></p>

                                        <h3>Pingus</h3>

                                                        <p>Pingus ist ein freier Clone des sch&ouml;nen alten Spiels "Lemminge": Retten Sie die Pinguine!</p>

                                                        <p><a href="http://pingus.seul.org/">Pingus</a>&nbsp;&nbsp;|&nbsp;&nbsp;<a href="http://de.wikipedia.org/wiki/Pingus">Info Pingus</a> </p> 				

					<h3>qgo</h3>

							<p>Das &uuml;ber 1500 Jahre alte japanische Brettspiel Go findet seit etwa 100 Jahren auch in Europa viele Freunde. Mit GNU Go gibt es eine spielstarke Engine, f&uuml;r die Qgo als Brett dient. Beide Programme sind vorinstalliert. Alternativ gibt es als Spielbretter noch das flexible Quarry und die Java-Anwendung Gogui die auf allen Betriebssystemen die gleiche Oberfl&auml;che bietet.</p>

							<p><a href="http://qgo.sourceforge.net">qgo</a> &nbsp;&nbsp;|&nbsp;&nbsp; <a href="http://www.gnu.org/software/gnugo/">gnugo</a> &nbsp;&nbsp;|&nbsp;&nbsp; <a href="http://home.gna.org/quarry/">quarry</a> &nbsp;&nbsp;|&nbsp;&nbsp; <a href="http://gogui.sourceforge.net/">gogui</a></p>

					<h3>Tipptrainer</h3>

							<p>Tipptrainer dient dem Erlernen und Festigen des 10-Finger-Tippsystems.</p>

							<p>Daf&uuml;r stehen dem Sch&uuml;ler zahlreiche Lektionen f&uuml;r das Tippen bestimmter Buchstabenkombinationen und Texte zur Verf&uuml;gung. Es gibt dabei Kurse f&uuml;r Anf&auml;nger und Fortgeschrittene.</p>

							<p><a href="http://tipptrainer.pingos.org/index.shtml">Tipptrainer</a></p>

					<h3>Tuxmath</h3>

							<p>Tuxmath ist ein Mathematiktrainer f&uuml;r Kinder.</p>

                                                        <p>Das Spielprinzip &auml;hnelt Missile Command, sprich es fallen Rechenaufgaben vom Himmel und Tux muss die richtige L&ouml;sung in seinen Abwehrlaser eingeben. Sonst werden die St&auml;dte zerst&ouml;rt.</p>

							<p><a href="http://www.newbreedsoftware.com/tuxmath/">TuxMath</a>&nbsp;&nbsp;|&nbsp;&nbsp; <a href="http://wiki.skolelinux.de/LernSoftware/Tuxmath">Info TuxMath</a></p>

					<h3>TuxType</h3>

							<p>TuxtType ist eine &Uuml;bungssoftware, mit deren Hilfe Kinder spielend den Umgang mit der Tastatur lernen.</p>

							<p>Das Spielprinzip &auml;hnelt dem Programm 'Missile Command', was bedeutet, dass Fische mit Buchstaben vom oberen Ende des Bildschirms fallen, die Tux fangen und essen soll. Hierzu muss man den entsprechenden Buchstaben erwischen, bzw. das richtige Wort eingeben.</p>

							<p>Es gibt verschiedene Spielmodi zum Ausw&auml;hlen - vom Tippen einzelner Buchstaben bis hin zu langen W&ouml;rtern. Dabei werden drei Schwierigkeitsstufen angeboten.</p>

							<p><a href="http://tuxtype.sourceforge.net/">TuxType</a></p>
        </div>

<!--Fusszeile-->

                        <div class="box">
  
                                <div class="center">

                                                        <p>Sollten Sie&nbsp;sich mit Verantwortlichen f&uuml;r dieses Projekt in Verbindung setzen wollen, schreiben Sie bitte <br />bei informellen Fragen eine <b>E-Mail</b> an <a href="mailto:info@seminarix.org">info@seminarix.org</a>, oder <br /> bei technischen Fragen eine <b>E-Mail</b> an <a href="mailto:edu@sidux-ev.de">edu@sidux-ev.de</a>.</p>

                                </div>

        </div>

                        <div id="rev">Content last revised 10/10/2009 1930 UTC</div>

</div>

</body>

</html>
