<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html lang="de-DE">
<head>

  <meta content="Willkommen auf der Website des Projektes SEMINARIX - der LiveCD f&uuml;r die Lehrerausbildung" name="description">

  <meta content="0" http-equiv="expires">

  <meta content="seminarix.org" http-equiv="reply-to">

  <meta content="Studienseminar Neuss" name="publisher">

  <meta content="Zimmermann" name="copyright">

  <meta content="Studienseminar Neuss, Lehrerausbildung, Linux, sidux, Linux in der Lehrerausbildung, NRW, LiveCD, Partner f&uuml;r Schule, Medienberatung" name="keywords">

  <meta content="INDEX, FOLLOW" name="ROBOTS">

  <meta content="de" name="Content-Language">

  <meta content="20 days" name="revisit-after">

  <meta content="text/html; charset=utf-8" http-equiv="Content-Type">

  <meta content="Wolf-Dieter Zimmermann" name="Author">

  <meta content="Mozilla/4.6 [de] (Win95; I) [Netscape]" name="GENERATOR">

  <title>Seminarix - Seminarix intern</title>
  
  <link rel="stylesheet" href="seminarix.css" type="text/css">
</head>


<body>



<div class="seite">

 <!--beginn kopfzeile -->
 
<div class="kopfzeile">
<!--logo kopfzeile links-->
<div class="kopflogo"><img src="pictures/semi-02.png" alt="logo" height="60" width="60"></div>
<!--ende logo kopfzeile links-->
<!--kopfmitte-->
<div class="kopfmitte"><img src="pictures/seminarix_logo_hp.png" name="logoseminarix" title="Logo SEMINARIX" alt="Logo SEMINARIX" height="70" width="337"><a name="top"></a><br>

<div class="logotext">Seminarix ist eine auf sidux aufbauende Live CD, die f&#252;r die Lehrerausbildung entwickelt wurde</div>
</div>

<!--ende kopfmitte-->
</div>

 <!--ende kopfzeile-->
 
 <!--hauptnavigation linke seite-->
 
<div class="hauptnavigation"> 

<a href="willkommen.html" type="text/html" target="_top">Willkommen</a>
<ul>


<!--<li><a target="_top" href="file:///K:/seminarix/infosystem-lokal/version_ohne_frames/kopie_vonLiveCD/htdocs/allgemein.html">Allgemein</a></li>-->
  <li><a target="_top" href="allgemein.html">Allgemein</a></li>


  <li><a target="_top" href="chemie.html">Chemie</a></li>


  <li><a target="_top" href="erdkunde.html">Erdkunde</a></li>


  <li><a target="_top" href="elearning.html">E-Learning</a></li>


  <li><a target="_top" href="informatik.html">Informatik</a></li>


  <li><a target="_top" href="kunst.html">Kunst</a></li>


  <li><a target="_top" href="lernspiele.html">Lernspiele</a></li>


  <li><a target="_top" href="mathematik.html">Mathematik</a></li>


  <li><a target="_top" href="musik.html">Musik</a></li>


  <li><a target="_top" href="physik.html">Physik</a></li>


  <li><a target="_top" href="religion.html">Religion</a></li>


  <li><a target="_top" href="sprachen.html">Sprachen</a></li>


  <li><a target="_top" href="technik.html">Technik</a></li>


  <li>&nbsp;</li>


</ul>


<a href="seminarix-intern.html" target="_top">Seminarix-Intern</a><br>


<a target="_top" href="impressum.html">Impressum</a><br>
<a href="../index.html" target="_top">Index</a>
</div>

 <!--ende hauptnavigation-->



<!--textbox mitte-->

<div class="text"><!--beginn der grossen textbox-->
<h2>Informationen zur Benutzung von Seminarix und der LiveCD</h2>




<p><span class="bold">Der Programmstarter</span></p>

<p>Durch Doppelklick oder Klick auf einen Startbutton wird das jeweilige Programm gestartet. Auch nicht auf der CD enthaltene Programme sind im Men&#252;system aufgef&#252;hrt. Dies ist dann an der ge&#228;nderten Buttonbeschriftung("Programm installieren" statt "Programm starten") erkennbar. Wird der entsprechende Eintrag angeklickt, erfolgt eine kurze R&#252;ckfrage ob das entsprechende Programm nachinstalliert werden soll.</p>

<p>In der Beschreibung zum jeweiligen Programm befindet sich auch ein Link zur Homepage auf der Sie noch mehr Informationen zum jeweiligen Programm finden.</p>

<p><img src="pictures/sidux-edu-starter.png" alt="sidux-edu-starter" width="698" height="529"></p>

<p>&nbsp;</p>

<p><span class="bold">Ein dauerhaftes Homeverzeichniss anlegen</span></p>

<p>Es kann auch ein persistentes Homeverzeichniss angelegt werden, in dem dann die &#228;nderung werden der Nutzung der LiveCD gespeichert werden k&#246;nnen um so nach dem n&#228;chsten Neustart der LiveCD diese wieder nutzen zu k&#246;nnen.</p>
<p>Mit sidux (ab Eros) kann ein dauerhaftes (persistentes) Live-System auf einer beschreibbaren Partition eingerichtet werden, indem die Bootoptionen 'fromiso' und 'persist' kombiniert werden.</p>

<p>sidux nutzt aufs, um mittels "copy on write" neue oder ver&#228;nderte Daten im RAM zu speichern. Mit der Bootoption persist k&#246;nnen diese Daten auf derjenigen Partition gespeichert werden, auf welcher sich das fromiso-CD-Abbild befindet.</p>

<p>persist verhilft zu einem Live-System, welches alle automatisierten Routinen der sidux-Live-CD enth&#228;lt (zum Beispiel Hardwarekonfiguration), gleichzeitig aber mit pers&#246;nlichen Daten und Einstellungen gebootet werden kann.</p>

<p>Zur Verdeutlichung: das System speichert nicht die Einstellungen des graphischen Servers X (Grafikkarte, Tastatur, Maus) oder der Netzwerkkarte, sondern nur die pers&#246;nlichen Daten und Einstellungen.Somit ist es ideal, um es auf mehr als einem Computer zu nutzen.</p>

<p>persist ist ideal in Kombination mit install-usb-gui, um einen bootbaren USB-Stick mit eigenen Daten und selbstgew&#228;hlter Software zu erstellen.</p>

<p>Die pers&#246;nlichen Daten werden in einem Unterverzeichnis der fromiso-Partition gespeichert. Wenn dieses Unterverzeichnis noch nicht vorhanden ist, wird es automatisch erstellt, wenn die Bootoptionen fromiso und persist gemeinsam benutzt werden.</p>

<p>Persist auf einem FAT-Dateisystem (vorformatiert auf den meisten Flash-Speichern) ben&#246;tigt eine große Datei, die als Loop-Ger&#228;t benutzt wird. Diese Datei muss formatiert werden (empfohlen ist ext3).</p>

<p>Diese Datei soll sidux-rw benannt werden und im Root-Verzeichnis der FAT-Partition (des mit FAT formatierten Flash-Speichers) platziert werden. Wenn die Partition zum Beispiel beschreibbar auf /media/sdb1 eingeh&#228;ngt ist und eine Datei mit 1GB Gr&#246;ße erstellt werden soll, um als dauerhaft genutzte Partition zu fungieren, werden folgende Befehle genutzt (es wird kein root ben&#246;tigt, wenn der user Schreibrechte hat):</p>

<p>disc="/media/sdb1"<br>
size=1024<br>
dd if=/dev/zero of=${disc}/sidux-rw bs=1M count=${size} &#038;&#038; echo 'y' | /sbin/mkfs.ext3 ${disc}/sidux-rw</p>
<div class="italicred">
<p>Mit NTFS formatierte Partitionen (Standard f&#252;r Windows NT/2000/XP/Vista (TM)) k&#246;nnen NICHT mit der Bootoption persist benutzt werden.</p>
</div>

<p>&nbsp;</p>

<p><span class="bold">Was nicht mehr auf die CD gepasst hat</span></p>

<p>OpenSource-Programme entwickeln sich st&#228;ndig weiter, tendenziell werden die entsprechenden Pakete immer umfangreicher. 
Aus diesen Gr&#252;nden musste daher aus Platzgr&#252;nden auf einige Pakete verzichtet werden, die noch in der letzten, noch auf Kubuntu 6.06 basierenden Version enthalten waren. Diese k&#246;nnen jedoch alle (bis auf NVU) direkt aus dem Programmstarter heraus nachinstalliert werden.</p>

<ul>
<li>KDissert</li>
<li>KSociograma</li>
<li>QGis</li>
<li>Gambas</li>
<li>Lazerus</li>
<li>Gimp</li>
<li>KView</li>
<li>blinKen</li>
<li>Einstein Puzzle</li>
<li>gTrans</li>
<li>KAnagram</li>
<li>KHangman</li>
<li>Glame</li>
<li>Kletters</li>
<li>Linux Letters and Numbers</li>
<li>Lmemory</li>
<li>Pimgus</li>
<li>Tipptrainer</li>
<li>TuxType</li>
<li>Octave</li>
<li>RKWard</li>
<li>Amarok</li>
<li>Glame</li>
<li>Celistia</li>
<li>Weltzeituhr</li>
<li>Xoscope</li>
<li>Kiten</li>
<li>KVerbos</li>
<Li>KTechlab</li>
<li>PCB</li>
<Li>qcad</li>
<li><span class="italicred">NVU</span></li> 
</ul>

<p>NVU wurde durch Quanta ersetzt, da NVU nicht in Debian enthalten ist. Die Einarbeitung in Quanta erfordert zwar anfangs einen etwas h&#246;heren Lernaufwand, daf&#252;r hat man dann aber ein weitaus leistungsf&#228;higeres Werkzeug zur Verf&#252;gung, welches außerdem wesentlich sauberere Webseiten generiert.</p>
<p>&nbsp;</p>
<p><span class="bold">Mitwirkende des sidux-seminarix-Projektes:</span></p>

<p>
Thomas Kross (captagon)<br>
Roland Engert (RoEn)<br>
Bj&#246;rn Jilg (BlueShadow)<br>
Ferdi Thommes (devil)<br>
Hendrik Lehmbruch (hendrikL)<br>
Horst Tritremmel (hjt)<br>
Dinko Sabo (cobra)<br>
Fabian Wuertz (xadras)<br>
Wolf-Dieter Zimmermann (emile)<br>
</p>
<p>Besonderer Dank geht an das gesamte sidux-Entwicklerteam, dessen hervorragende Leistung dieses Projekt erst m&#246;glich gemacht hat.</p>
<p>&nbsp;</p>
<p>Weitere Informationen zur Installation von Seminarix finden Sie in den Manual-Pages von sidux.</p>
<p><a href="/usr/share/sidux-manual/de/welcome-de.htm" target="_blank">sidux-manual deutsch</a><br>
<a href="/usr/share/sidux-manual/en/welcome-en.htm" target="_blank">sidux-manual english</a></p>
<p><a href="http://sidux.com/index.php?module=pnWikka&#038;tag=Startseite" target="_blank">sidux-Wiki deutsch</a><br>
<a href="http://sidux.com/index.php?module=pnWikka&#038;tag=Homepage" target="_blank">sidux-Wiki english</a>
</p>
<!--in der seite nach oben-->
<dl>
<dt><a href="#top">TOP</a></dt><!--in der seite nach oben-->
<dd>&nbsp;</dd>
<dd>&nbsp;</dd>
</dl>





<!--Fusszeile-->
<div class="Fusszeile">
<div class="center"><!--centriert den text-->
<p>Sollten Sie&nbsp;sich mit Verantwortlichen f&#252;r dieses Projekt in Verbindung setzen wollen, schreiben Sie bitte bei informellen Fragen eine <span class="bold">Email</span> an <a href="mailto:info@seminarix.org">info@seminarix.org</a>,<br>
oder bei technischen Fragen eine <span class="bold">Email</span> an <a href="mailto:edu@sidux-ev.de">edu@sidux-ev.de</a></p>


</div>

<!--ende div center-->

</div>

<!--ende div Fusszeile-->


</div>

 <!--ende div text -->


<!--<div class="bgimg"><img src="pictures/gaia.png" alt="bild sidux gaia" height="145" width="200"></div>-->




</div>

 <!--ende seite-->

</body>
</html>
